分为三大部分

1. 对于 train_x, train_y 

	[1000, 10]   [1000, 10] -> [1000, 10, 2]

	每次取第i行  [10, 2]

	将第一列作为x,将第二列作为label y 
	[10, ]					[10,]
	np.newaxis ->
	[10, 1]					[10, 1]
	输入 x [10, 1] xy [10, 2]
	xy [10, 2].linear(2, 20) -> [10, 20]
	xy.mean(, dim=0) -> [1, 20]  按行取均值
	xy.expand(batch_size, ) -> [10, 20]

	x.cat((x, xy), dim=1) -> [10, 21]  按列拼接

	x [10, 21].linear(21, 1) -> [10, 1]

	x[10, 1] v.s. y[10, 1]

2. 对于evaluta_finetune_x, evaluate_finetune_y

	[100, 5]    [100, 5]  -> [100, 5, 2]

	每次取第i行  [5, 2]

	将最后一行的第一列作为x, 将最后一行的第二列作为label y
	[1, ]                                      [1, ]
	np.newaxis ->
	[1, 1]                                     [1, 1]
	输入 x [1, 1]  xy [4, 2]
	xy [4, 2].linear(2, 20) -> [4, 20]
	xy.mean(, dim=0) -> [1, 20] 按行取均值
	xy.expand(batch_size, ) -> [1, 20]

	x.cat((x, xy), dim=1) -> [1, 21] 按列拼接
	x [1, 21].linear(21, 1) -> [1, 1]

	x[1, 1] v.s. y[1, 1]

3.  对于evaluta_x

	[100, 100]
	每次取第i行  [100, ]

	np.newaxis -> [100, 1]

	x [100, 1]    xy [5, 2]

	xy [5, 2] -> [5, 20] -> [1, 20] -> [100, 20]

	x + xy -> [100, 21] -> [100, 1]



